import React from 'react';
import {Stack, Typography} from "@mui/material";

export default function MainDescription() {
  return (
    <Stack sx={{
      backgroundColor: '#f9f9f9',
      padding: '40px',
      borderRadius: '10px',
      boxShadow: '0 0 20px rgba(0, 0, 0, 0.1)',
    }}>
      <Typography variant="h1" mt={4} mb={3} fontSize="2rem" textAlign={'center'} color="#333">
        <b>ИП Герасимов Иван Николаевич</b> – ваш надежный партнер в мире инновационных решений для гидроизоляции!
      </Typography>

      <Typography variant="body1" sx={{marginTop: 2, fontSize: "1.3rem", color: '#555'}} textAlign={'center'}>
        Свыше 15 лет превосходства на рынке гидроизоляции в Российской Федерации. Наш долголетний опыт — это много лет
        использования передовых технологий и полимерных составов за границей.
        Мы не только применяем последние материалы, но и создаем инновационные технологии, материалы и методы монтажа,
        что делает нас лучшими в индустрии гидроизоляции.
        Наше стремительное развитие и расширение географии присутствия делают нас идеальными партнерами для строительных
        компаний, ищущих надежные и инновационные решения.
        Мы максимально используем все наши ресурсы, опыт и знания, чтобы предоставить нашим клиентам современные
        продукты, материалы и технологии.
        Доверие к нам выражают не только строительные компании, но и крупные торговые и промышленные организации.
        Наши продукты и решения пользуются успехом не только в России, но и в странах ближнего зарубежья, Европе, Азии и
        Ближнем Востоке.
        Если у вас возникли проблемы с гидроизоляцией, обращайтесь к нам. Мы готовы предоставить надежные решения для
        всех ваших задач.
      </Typography>
    </Stack>
  );
}
