import React from 'react';
import { Box, CardMedia, Container, Grid, Paper, Typography } from '@mui/material';

const WaterproofingBlog = () => {
  // Разные тексты для каждого блока
  const texts = [
    "Гидроизоляция - это важный процесс, который направлен на защиту строительных конструкций от влаги и воды. Она играет решающую роль в обеспечении долговечности и надежности зданий и сооружений, так как влага может привести к разрушению материалов и образованию плесени и грибков.",
    "Гидроизоляция применяется на разных уровнях строительства, включая кровлю, фундамент, стены и полы. Она создает барьер, который предотвращает воду и влагу от проникновения во внутренние пространства здания. Таким образом, гидроизоляция обеспечивает сохранность и долговечность здания.",
    "Гидроизоляция не только предотвращает повреждение здания, но и способствует созданию комфортных и здоровых условий для жизни. Она защищает от протечек, утечек и влаги, что способствует предотвращению образования плесени и грибков, которые могут нанести вред здоровью.",
    "Гидроизоляция также является важным аспектом энергоэффективности зданий. Правильно выполненная гидроизоляция помогает предотвратить потерю тепла и уменьшить затраты на отопление и кондиционирование воздуха."
  ];

  return (
    <Box sx={{ mt: 3, mb: 3 }}>
      <Typography variant="h1" sx={{ fontSize: 32, fontWeight: 'bold', mb: 4, textAlign: 'center' }}>
        Гидроизоляция: Защита вашего дома от воды и влаги
      </Typography>

      <CardMedia
        component="img"
        sx={{ borderRadius: 4 }}
        height="200"
        image={"/static/title.jpg"}
        alt={'no image'}
      />

      <Grid container spacing={4} mt={2}>
        {texts.map((text, index) => (
          <Grid item xs={12} md={6} key={index}>
            <Paper elevation={3} sx={{ p: 3, height: '100%' }}>
              <Typography variant="body1" sx={{ fontSize: 18, mb: 2 }} component={'h3'}>
                {text}
              </Typography>
            </Paper>
          </Grid>
        ))}
      </Grid>
    </Box>
  );
};

export default WaterproofingBlog;
